index.org
#+title: CAS CS 132: Geometric Algorithms
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+OPTIONS: html-style:nil H:1 toc:nil num:nil
This course is an introduction to linear algebra with an emphasis on
applications in computer science.  It's based heavily on (and depends
on the material for) the version of the course taught by [[https://www.cs.bu.edu/fac/crovella/][Mark Crovella]].
* Links
+ [[file:manual/main.pdf][Course Manual]]
+ [[file:workbook/v001.pdf][Course Workbook]]
+ Course Repository
+ [[https://piazza.com/bu/spring2026/cascs132][Piazza]]
+ [[https://www.gradescope.com/courses/1222810][Gradescope]] (6XXVDP)
+ Reading:
  + [[http://mcrovella.github.io/CS132-Geometric-Algorithms/landing-page.html][Linear Algebra, Geometry and Computation]]
  + [[https://textbooks.math.gatech.edu/ila/][Interactive Linear Algebra]]
  + [[http://nmmull.github.io/CS132-Notes/toc.html][Supplementary Notes on Solving Linear Systems]]
+ Programming Resources: [[https://www.python.org][Python]], [[https://numpy.org][NumPy]], [[https://scipy.org][SciPy]], [[https://matplotlib.org][Matplotlib]],
  [[https://scikit-learn.org/stable/][scikit-learn]], [[https://networkx.org][NetworkX]]
* Schedule
|------+-----------------------------------+------------------------|
| Date | Topic                             | Notes                  |
|------+-----------------------------------+------------------------|
| 1/20 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L01LinearEquations.html][Solving Linear Systems]]            | Read the course manual |
| 1/22 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L01LinearEquations.html][Echelon Forms]]                     | Assignment 1 (A1) out  |
|------+-----------------------------------+------------------------|
| 1/26 | Lab 1: Introduction to NumPy      |                        |
| 1/27 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L03RowReductions.html][Gaussian Elimination]]              |                        |
| 1/29 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L04VectorEquations.html][Vector Equations]] (Workshop)       | A2 out, A1 due         |
|------+-----------------------------------+------------------------|
| 2/2  | Quiz 1                            |                        |
| 2/3  | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L05Axb.html][Matrix-Vector Equations]]           |                        |
| 2/5  | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L06LinearIndependence.html][Linear Independence]]               | A3 out, A2 due         |
|------+-----------------------------------+------------------------|
| 2/9  | Lab 2: Leslie Matrices            |                        |
| 2/10 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L07LinearTransformations.html][Linear Transformations]]            |                        |
| 2/12 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L08MatrixofLinearTranformation.html][Matrix Transformations]] (Workshop) | A4 out, A3 due         |
|------+-----------------------------------+------------------------|
| 2/16 | *No Lab*                          | Presidents’ Day        |
| 2/17 | Quiz 2                            | *Substitute Monday*    |
| 2/19 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L09MatrixOperations.html][Matrix Algebra]]                    | A5 out, A4 due         |
|------+-----------------------------------+------------------------|
| 2/23 | Lab 3: Numerical Linear Algebra   |                        |
| 2/24 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L10MatrixInverse.html][Matrix Inverse]]                    |                        |
| 2/26 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L12MatrixFactorizations.html][LU Factorization]] (Workshop)       | A5 due                 |
|------+-----------------------------------+------------------------|
| 3/2  | Midterm Review                    |                        |
| 3/3  | Algebraic Graph Theory            |                        |
| 3/5  | *Midterm Exam*                    | A6 out                 |
|------+-----------------------------------+------------------------|
| 3/9  | *No Lab*                          | Spring recess          |
| 3/10 | *No Lecture*                      | Spring recess          |
| 3/12 | *No Lecture*                      | Spring recess          |
|------+-----------------------------------+------------------------|
| 3/16 | Quiz 3                            |                        |
| 3/17 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L11MarkovChains.html][Markov Chains]]                     |                        |
| 3/19 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L13ComputerGraphics.html][Computer Graphics]]                 | A7 out, A6 due         |
|------+-----------------------------------+------------------------|
| 3/23 | Lab 4: Graphics                   |                        |
| 3/24 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L14Subspaces.html][Subspaces]]                         |                        |
| 3/26 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L15DimensionRank.html][Dimension and Rank]] (Workshop)     | A8 out, A7 due         |
|------+-----------------------------------+------------------------|
| 3/30 | Quiz 4                            |                        |
| 3/31 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L16Eigenvectors.html][Eigenvalues and Eigenvectors]]      |                        |
| 4/2  | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L17CharacteristicEqn.html][The Characteristic Equation]]       | A9 out, A8 due         |
|------+-----------------------------------+------------------------|
| 4/6  | Lab 5: PageRank                   |                        |
| 4/7  | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L18Diagonalization.html][Diagonalization]]                   |                        |
| 4/9  | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L20Orthogonality.html][Orthogonality]] (Workshop)          | A10 out, A9 due        |
|------+-----------------------------------+------------------------|
| 4/13 | Quiz 5                            |                        |
| 4/14 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L21OrthogonalSets.html][Orthogonal Projection]]             |                        |
| 4/16 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L22LeastSquares.html][Least Squares]]                     | A11 out, A10 due       |
|------+-----------------------------------+------------------------|
| 4/20 | *No Lab*                          | Patriots’ Day          |
| 4/21 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L23LinearModels.html][Linear Models]]                     |                        |
| 4/22 | Lab 6: Multiple Regression        |                        |
| 4/23 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L24SymmetricMatrices.html][Quadratic Forms]] (Workshop)        | A12 out, A11 due       |
|------+-----------------------------------+------------------------|
| 4/27 | Final Exam Review                 |                        |
| 4/28 | [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L25SVD.html][Singular Value Decomposition]]      |                        |
| 4/30 | [[https://mcrovella.github.io/CS132-Geometric-Algorithms/L26ApplicationsOfSVD.html][Applications of SVD]]               | A12 due                |
|------+-----------------------------------+------------------------|
* Calendar
#+begin_export html
<iframe src="https://calendar.google.com/calendar/embed?height=600&wkst=1&ctz=America%2FNew_York&showPrint=0&showTitle=0&showTabs=0&showCalendars=0&showTz=0&mode=WEEK&src=Y18xNmFlZmQ1NDllYWEzYjgyNmY2YTk0YzAwNzQ4ZDVhYTA0NjBmZjkzYTZhYTAyMzAwNDhiODg0YjMwMTdjMzM2QGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20&color=%233f51b5" style="border-width:0" width="1000" height="600" frameborder="0" scrolling="no"></iframe>
#+end_export
* Course Staff
+ Instructor: [[https://nmmull.github.io][Nathan Mull]]
+ Teaching Fellow: Angelos Poulis
+ Course Assistants: Sohan Atluri and Gor Matcakian

/Do not contact course staff directly except in extenuating
circumstances. If you have course-related questions/concerns, post on
Piazza./
