index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-19 Mon 18:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CAS CS 132: Geometric Algorithms</title>
<meta name="author" content="Nathan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">CAS CS 132: Geometric Algorithms</h1>
<p>
This course is an introduction to linear algebra with an emphasis on
applications in computer science.  It's based heavily on (and depends
on the material for) the version of the course taught by <a href="https://www.cs.bu.edu/fac/crovella/">Mark Crovella</a>.
</p>
<div id="outline-container-org3e45775" class="outline-2">
<h2 id="org3e45775">Links</h2>
<div class="outline-text-2" id="text-org3e45775">
<ul class="org-ul">
<li><a href="manual/main.pdf">Course Manual</a></li>
<li><a href="workbook/v001.pdf">Course Workbook</a></li>
<li>Course Repository</li>
<li><a href="https://piazza.com/bu/spring2026/cascs132">Piazza</a></li>
<li><a href="https://www.gradescope.com/courses/1222810">Gradescope</a> (6XXVDP)</li>
<li>Reading:
<ul class="org-ul">
<li><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/landing-page.html">Linear Algebra, Geometry and Computation</a></li>
<li><a href="https://textbooks.math.gatech.edu/ila/">Interactive Linear Algebra</a></li>
<li><a href="http://nmmull.github.io/CS132-Notes/toc.html">Supplementary Notes on Solving Linear Systems</a></li>
</ul></li>
<li>Programming Resources: <a href="https://www.python.org">Python</a>, <a href="https://numpy.org">NumPy</a>, <a href="https://scipy.org">SciPy</a>, <a href="https://matplotlib.org">Matplotlib</a>,
<a href="https://scikit-learn.org/stable/">scikit-learn</a>, <a href="https://networkx.org">NetworkX</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgff4b95f" class="outline-2">
<h2 id="orgff4b95f">Schedule</h2>
<div class="outline-text-2" id="text-orgff4b95f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Topic</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1/20</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L01LinearEquations.html">Solving Linear Systems</a></td>
<td class="org-left">Read the course manual</td>
</tr>

<tr>
<td class="org-left">1/22</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L01LinearEquations.html">Echelon Forms</a></td>
<td class="org-left">Assignment 1 (A1) out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">1/26</td>
<td class="org-left">Lab 1: Introduction to NumPy</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1/27</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L03RowReductions.html">Gaussian Elimination</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1/29</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L04VectorEquations.html">Vector Equations</a> (Workshop)</td>
<td class="org-left">A2 out, A1 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2/2</td>
<td class="org-left">Quiz 1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/3</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L05Axb.html">Matrix-Vector Equations</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/5</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L06LinearIndependence.html">Linear Independence</a></td>
<td class="org-left">A3 out, A2 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2/9</td>
<td class="org-left">Lab 2: Leslie Matrices</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/10</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L07LinearTransformations.html">Linear Transformations</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/12</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L08MatrixofLinearTranformation.html">Matrix Transformations</a> (Workshop)</td>
<td class="org-left">A4 out, A3 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2/16</td>
<td class="org-left"><b>No Lab</b></td>
<td class="org-left">Presidents’ Day</td>
</tr>

<tr>
<td class="org-left">2/17</td>
<td class="org-left">Quiz 2</td>
<td class="org-left"><b>Substitute Monday</b></td>
</tr>

<tr>
<td class="org-left">2/19</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L09MatrixOperations.html">Matrix Algebra</a></td>
<td class="org-left">A5 out, A4 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2/23</td>
<td class="org-left">Lab 3: Numerical Linear Algebra</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/24</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L10MatrixInverse.html">Matrix Inverse</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/26</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L12MatrixFactorizations.html">LU Factorization</a> (Workshop)</td>
<td class="org-left">A5 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3/2</td>
<td class="org-left">Midterm Review</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/3</td>
<td class="org-left">Algebraic Graph Theory</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/5</td>
<td class="org-left"><b>Midterm Exam</b></td>
<td class="org-left">A6 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3/9</td>
<td class="org-left"><b>No Lab</b></td>
<td class="org-left">Spring recess</td>
</tr>

<tr>
<td class="org-left">3/10</td>
<td class="org-left"><b>No Lecture</b></td>
<td class="org-left">Spring recess</td>
</tr>

<tr>
<td class="org-left">3/12</td>
<td class="org-left"><b>No Lecture</b></td>
<td class="org-left">Spring recess</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3/16</td>
<td class="org-left">Quiz 3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/17</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L11MarkovChains.html">Markov Chains</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/19</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L13ComputerGraphics.html">Computer Graphics</a></td>
<td class="org-left">A7 out, A6 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3/23</td>
<td class="org-left">Lab 4: Graphics</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/24</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L14Subspaces.html">Subspaces</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/26</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L15DimensionRank.html">Dimension and Rank</a> (Workshop)</td>
<td class="org-left">A8 out, A7 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3/30</td>
<td class="org-left">Quiz 4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/31</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L16Eigenvectors.html">Eigenvalues and Eigenvectors</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/2</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L17CharacteristicEqn.html">The Characteristic Equation</a></td>
<td class="org-left">A9 out, A8 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4/6</td>
<td class="org-left">Lab 5: PageRank</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/7</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L18Diagonalization.html">Diagonalization</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/9</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L20Orthogonality.html">Orthogonality</a> (Workshop)</td>
<td class="org-left">A10 out, A9 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4/13</td>
<td class="org-left">Quiz 5</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/14</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L21OrthogonalSets.html">Orthogonal Projection</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/16</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L22LeastSquares.html">Least Squares</a></td>
<td class="org-left">A11 out, A10 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4/20</td>
<td class="org-left"><b>No Lab</b></td>
<td class="org-left">Patriots’ Day</td>
</tr>

<tr>
<td class="org-left">4/21</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L23LinearModels.html">Linear Models</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/22</td>
<td class="org-left">Lab 6: Multiple Regression</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/23</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L24SymmetricMatrices.html">Quadratic Forms</a> (Workshop)</td>
<td class="org-left">A12 out, A11 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4/27</td>
<td class="org-left">Final Exam Review</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/28</td>
<td class="org-left"><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L25SVD.html">Singular Value Decomposition</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/30</td>
<td class="org-left"><a href="https://mcrovella.github.io/CS132-Geometric-Algorithms/L26ApplicationsOfSVD.html">Applications of SVD</a></td>
<td class="org-left">A12 due</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org566ccac" class="outline-2">
<h2 id="org566ccac">Calendar</h2>
<div class="outline-text-2" id="text-org566ccac">
<iframe src="https://calendar.google.com/calendar/embed?height=600&wkst=1&ctz=America%2FNew_York&showPrint=0&showTitle=0&showTabs=0&showCalendars=0&showTz=0&mode=WEEK&src=Y18xNmFlZmQ1NDllYWEzYjgyNmY2YTk0YzAwNzQ4ZDVhYTA0NjBmZjkzYTZhYTAyMzAwNDhiODg0YjMwMTdjMzM2QGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20&color=%233f51b5" style="border-width:0" width="1000" height="600" frameborder="0" scrolling="no"></iframe>
</div>
</div>
<div id="outline-container-orga0ab63a" class="outline-2">
<h2 id="orga0ab63a">Course Staff</h2>
<div class="outline-text-2" id="text-orga0ab63a">
<ul class="org-ul">
<li>Instructor: <a href="https://nmmull.github.io">Nathan Mull</a></li>
<li>Teaching Fellow: Angelos Poulis</li>
<li>Course Assistants: Sohan Atluri and Gor Matcakian</li>
</ul>

<p>
<i>Do not contact course staff directly except in extenuating
circumstances. If you have course-related questions/concerns, post on
Piazza.</i>
</p>
</div>
</div>
</div>
</body>
</html>
